USE test_task;
GO

-- временная таблица
CREATE TABLE #DateCountTable (
    _date DATE NOT NULL,
    _count INT NOT NULL
);
GO

-- во входных данных в задании не было дат с разными годами,
-- но я решил для теста написать разные даты,
-- из-за этого пришлось дописать алгоритм и теперь
-- это должно работать с любыми датами

-- взял чуть побольше данных для тестов
INSERT INTO #DateCountTable (_date, _count)
VALUES 
	('2022-01-01', 4),
    ('2022-02-01', 6),
    ('2022-03-01', 2),
    ('2022-04-01', 5),
    ('2022-05-01', 3),
    ('2022-06-01', 7),
    ('2022-07-01', 1),
    ('2022-08-01', 3),
    ('2022-09-01', 6),
    ('2022-10-01', 2),
    ('2022-11-01', 4),
    ('2022-12-01', 5),
    ('2022-02-15', 3),
    ('2022-03-22', 7),
    ('2022-04-18', 2),
    ('2022-05-25', 6),
    ('2022-06-12', 4),
    ('2022-07-19', 3),
    ('2022-08-27', 5),
    ('2022-09-14', 2),
    ('2022-10-21', 6),
    ('2022-11-17', 1),
    ('2022-12-24', 7),
    ('2023-01-01', 3),
    ('2023-02-01', 5),
    ('2023-03-01', 2),
    ('2023-04-01', 6),
    ('2023-05-01', 4),
    ('2023-06-01', 3),
    ('2023-07-01', 7),
    ('2023-08-01', 2),
    ('2023-09-01', 5),
    ('2023-10-01', 6),
    ('2023-11-01', 4),
    ('2023-12-01', 3),
    ('2023-02-14', 2),
    ('2023-03-21', 5),
    ('2023-04-17', 6),
    ('2023-05-24', 3),
    ('2023-06-11', 7),
    ('2023-07-18', 4),
    ('2023-08-25', 2),
    ('2023-09-13', 6),
    ('2023-10-20', 3),
    ('2023-11-16', 5),
    ('2023-12-23', 1),
    ('2024-01-01', 4),
    ('2024-02-01', 6),
    ('2024-03-01', 2),
    ('2024-04-01', 5),
    ('2024-05-01', 3),
    ('2024-06-01', 7),
    ('2024-07-01', 1),
    ('2024-08-01', 3),
    ('2024-09-01', 6),
    ('2024-10-01', 2),
    ('2024-11-01', 4),
    ('2024-12-01', 5),
    ('2024-02-15', 3),
    ('2024-03-22', 7),
    ('2024-04-18', 2),
    ('2024-05-25', 6),
    ('2024-06-12', 4),
    ('2024-07-19', 3),
    ('2024-08-27', 5),
    ('2024-09-14', 2),
    ('2024-10-21', 6),
    ('2024-11-17', 1),
    ('2024-12-24', 7),
    ('2025-01-01', 3),
    ('2025-02-01', 5),
    ('2025-03-01', 2),
    ('2025-04-01', 6),
    ('2025-05-01', 4),
    ('2025-06-01', 3),
    ('2025-07-01', 7),
    ('2025-08-01', 2),
    ('2025-09-01', 5),
    ('2025-10-01', 6),
    ('2025-11-01', 4),
    ('2025-12-01', 3),
    ('2025-02-14', 2),
    ('2025-03-21', 5),
    ('2025-04-17', 6),
    ('2025-05-24', 3),
    ('2025-06-11', 7),
    ('2025-07-18', 4),
    ('2025-08-25', 2),
    ('2025-09-13', 6),
    ('2025-10-20', 3),
    ('2025-11-16', 5),
    ('2025-12-23', 1)
GO
set statistics time on;
-- CTE для группировки данных
WITH AggregatedData AS (
    SELECT 
		-- я думал использовать ли CASE WHEN вместо IIF,
		-- но подумал, что раз уж сказано написать на T-SQL,
		-- то нужно использовать фичи T-SQL
        IIF(DAY(_date) = 1,				-- если дата - первое число месяца
		FORMAT(_date, 'dd.MM.yyyy'),	-- то дата форматируется так
		FORMAT(_date, 'MM.yyyy'))		-- в противном случае так
		AS _date,
        SUM(_count) AS _count
    FROM #DateCountTable
    GROUP BY 
		-- группируется по дате с первым числом и без первого числа
        IIF(DAY(_date) = 1, FORMAT(_date, 'dd.MM.yyyy'), FORMAT(_date, 'MM.yyyy'))
		
)

SELECT 
    _date,
    _count
FROM AggregatedData
ORDER BY 
	-- явное преобразование строки в дату для сортировки
	-- подставили 01. к датам MM.yyyy для того, чтобы
	-- даты шли в хронологическом порядке
    IIF(LEN(_date) = 10, TRY_CAST(_date AS DATE), TRY_CAST('01.' + _date AS DATE))
GO

-- логическое завершение работы с временной таблицей
DROP TABLE #DateCountTable;
GO
set statistics time off
-- Конечно, конвертировать даты в строку, чтобы потом конвертировать обратно в дату
-- для упорядочивания может быть не совсем правильно performance-wise, но
-- я думаю, что try_cast достаточно быстро конвертирует дату и проблем не должно быть